import drinkImage from "../assets/drink.png";
import proteinImage from "../assets/protein.png";
import matchaImage from "../assets/matcha.png";
import proteinShakeImage from "../assets/protein-shake.png";

const HealthBlog = [
    {
        id: "01",
        title: "การรักษาร่างกายให้ชุ่มชื้น",
        subTitle: "น้ำสนับสนุนภูมิคุ้มกันได้อย่างไร?",
        detail: "การรักษาสุขภาพและความชุ่มชื้นของร่างกายไม่ได้มาจากการทานอาหารที่มีสารอาหารเพียงพอเท่านั้น แต่ยังขึ้นอยู่กับการดื่มน้ำอย่างเพียงพอด้วย เนื่องจากน้ำเป็นสิ่งสำคัญที่ช่วยรักษาสุขภาพทั้งภูมิคุ้มกันและความชุ่มชื้นของผิวหนัง เรามาทำความเข้าใจว่าทำไมน้ำมี per serving และวิธีการใช้งานให้ถูกต้อง",
        contentTitle: ["น้ำและระบบภูมิคุ้มกัน", "น้ำและความชุ่มชื้นของผิวหนัง", "วิธีการรับประทานน้ำอย่างเหมาะสม", "สรุป"],
        content: ["ภูมิคุ้มกันเป็นเกราะที่ปกป้องร่างกายจากเชื้อโรคและการต่อสู้กับสารพิษ การดื่มน้ำเพียงพอช่วยให้ระบบภูมิคุ้มกันทำงานได้สมบูรณ์แข็งแรง เพราะน้ำช่วยในการขับของเสียออกจากร่างกาย ดังนั้นการดื่มน้ำเพียงพอช่วยลดความเสี่ยงในการเป็นโรคต่างๆ ได้โดยตรง", "ผิวหนังที่ชุ่มชื้นมีการเกิดเซลล์ผิวใหม่อย่างสม่ำเสมอและเนื้อเยื่อผิวหนังที่แข็งแรง การดื่มน้ำเพียงพอช่วยในการรักษาความชุ่มชื้นของผิวหนังโดยตรง และลดความเสี่ยงในการเกิดปัญหาผิวหนังเช่น ผิวแห้ง แผลเป็นกลาง หรืออาการผิวหมองคล้ำ", "1. ดื่มน้ำเพิ่มเติมเมื่อมีความต้องการ: ร่างกายของเรามีการสูญเสียน้ำตลอดเวลาผ่านการหายใจ เหงื่อ และปัสสาวะ ดังนั้นควรดื่มน้ำเพิ่มเติมในสภาวะที่ต้องการ เช่น ในช่วงออกกำลังกาย ในสภาพอากาศร้อน หรือเมื่อรู้สึกกระหายน้ำ 2.ติดตามปริมาณการดื่มน้ำ: ระบบภูมิคุ้มกันและผิวหนังของเราต้องการน้ำเพียงพอตลอดเวลา ดังนั้นควรติดตามปริมาณการดื่มน้ำที่แนะนำสำหรับแต่ละวัยและสภาวะการกิจกรรม 3. หลีกเลี่ยงการดื่มเครื่องดื่มที่มีการเติมน้ำตาล: การบริโภคเครื่องดื่มที่มีน้ำตาลเพิ่ม เช่น น้ำอัดลม น้ำเครื่องดื่มชุ่มชื้น สามารถทำให้ร่างกายสูญเสียน้ำและเสี่ยงต่อการเกิดโรคต่างๆ 4.การบริโภคผลไม้และผัก: ผลไม้และผักมีปริมาณน้ำสูงและเป็นที่มาของสารอาหารที่สำคัญ การบริโภคผลไม้และผักอย่างเพียงพอช่วยเพิ่มปริมาณน้ำในร่างกาย", "การดื่มน้ำเพียงพอและการดูแลสุขภาพโดยรวมอาจเป็นเรื่องที่ดูเหมือนเรื่องเล็กน้อย แต่มันมีผลกระทบที่มีนามสำคัญต่อสุขภาพของเราทั้งหมด ดังนั้น ขอแนะนำให้ให้ความสำคัญกับการดื่มน้ำเพียงพอและการดูแลสุขภาพเป็นระยะเวลายาวในการรักษาร่างกายให้ชุ่มชื้นและสุขภาพแข็งแรงอย่างยั่งยืน!"],
        image: drinkImage,
    },
    {
        id: "02",
        title: "ทําไมคุณถึงต้องการโปรตีน",
        subTitle: "กรดอะมิโนทํางานอย่างไรในร่างกายของคุณ",
        detail: "การรักษาสุขภาพและความแข็งแรงของร่างกายมักจะยึดมั่นในการดูแลโปรตีนในอาหารของเรา โปรตีนเป็นส่วนสำคัญที่มีผลต่อการเจริญเติบโตของร่างกายและฟื้นฟูเซลล์ นอกจากนี้ โปรตีนยังมีบทบาทสำคัญในการส่งเสริมสุขภาพอื่นๆ ของร่างกายด้วย มาเริ่มต้นด้วยการเข้าใจว่ากรดอะมิโน (amino acids) ทำงานอย่างไรในร่างกายของเรา",
        contentTitle: ["กรดอะมิโน: สารก่อตัวของโปรตีน", "ฟังก์ชันของกรดอะมิโนในร่างกาย", "สรุป"],
        content: ["โปรตีนประกอบด้วยกรดอะมิโน กรดอะมิโนคือตัวก่อตัว ของโปรตีนที่มีหน้าที่สำคัญในการสร้างและฟื้นฟูเซลล์ในร่างกาย เรามีจำนวนกรดอะมิโนที่ต่างกันภายในร่างกาย ซึ่งแต่ละสารมีบทบาทและฟังก์ชันที่แตกต่างกันตามความต้องการของร่างกาย", "1. สร้างและฟื้นฟูเซลล์: กรดอะมิโนช่วยสร้างเซลล์ใหม่และซ่อมแซมเซลล์ที่เสียหาย ซึ่งเป็นสิ่งสำคัญสำหรับการเจริญเติบโตและฟื้นฟูร่างกายหลังจากการบาดเจ็บหรือการออกกำลังกาย 2.สร้างฮอร์โมนและเอนไซม์: กรดอะมิโนมีบทบาทในการสร้างฮอร์โมนและเอนไซม์ที่สำคัญสำหรับการทำงานของร่างกาย เช่น ฮอร์โมนเจนเท้า (insulin) ที่ช่วยควบคุมระดับน้ำตาลในเลือด 3.สนับสนุนระบบภูมิคุ้มกัน: บางกรดอะมิโนมีบทบาทในการสร้างแอนติบอดีส (antibodies) ที่ช่วยป้องกันการติดเชื้อและโรคต่างๆ ในร่างกาย 4.สนับสนุนสุขภาพกล้ามเนื้อและกระดูก: การบริโภคโปรตีนเพื่อให้ได้กรดอะมิโนที่เหมาะสมช่วยในการสร้างและซ่อมแซมกล้ามเนื้อและกระดูก ซึ่งเป็นสิ่งสำคัญในการรักษาความแข็งแรงและความหล่อหลอมของร่างกาย", "การรับประทานโปรตีนอย่างเพียงพอและครบถ้วนเป็นสิ่งสำคัญในการรักษาสุขภาพของร่างกาย ซึ่งโปรตีนมักจะมีอยู่ในอาหารหลากหลายประเภท เช่น เนื้อสัตว์ ไข่ ถั่ว นม และอาหารทะเล เราควรให้ความสำคัญกับการรับประทานโปรตีนให้เพียงพอและสมดุล เพื่อให้ร่างกายสามารถทำงานอย่างมีประสิทธิภาพและรักษาสุขภาพได้อย่างเต็มที่"],
        image: proteinImage,
    },
    {
        id: "03",
        title: "Matcha and Red Bean Shake",
        subTitle: "ถั่วแดงหวานและมัทฉะแสนอร่อยผสมผสานกันในเชคโปรตีนนี้เพื่อเสริมคุณค่าทางโภชนาการ",
        detail: "การผสมผสานรสชาติของ Matcha (ชาเขียวญี่ปุ่น) และ Red Bean (ถั่วแดง) เป็นหนึ่งในความพึงพอใจทางอาหารที่น่าตื่นเต้น ไม่เพียงแต่ความอร่อยที่ได้รับจากการผสมผสานที่ลงตัว แต่ยังมีประโยชน์ต่อสุขภาพอีกด้วย มาสำรวจกันว่าทำไมคู่นี้ถึงเป็นที่นิยมและมีความนิยมในหลายวงความสนใจอย่างกว้างขวาง!",
        contentTitle: ["Matcha: ความอร่อยและประโยชน์สุขภาพ", "Red Bean: รสชาติหวานและสารอาหาร", "การผสมผสาน Matcha และ Red Bean: ความอร่อยและสุขภาพที่ลงตัว", "สุขภาพที่ดีและความอร่อยที่มีความหมาย", "สรุป"],
        content: ["Matcha เป็นชาเขียวที่ถูกบดละเอียดจนเป็นผง ซึ่งมีรสชาติหอมหวานและความเข้มข้นที่ไม่เหมือนใคร นอกจากนี้ Matcha เต็มไปด้วยสารต้านอนุมูลอิสระที่ช่วยปกป้องร่างกายจากอันตรายของอนุมูลอิสระและการเสื่อมสภาพของเซลล์", "Red Bean เป็นที่รู้จักในภูมิภาคเอเชียเป็นอย่างดี มีรสชาติหวานเข้มข้นและเนื้อฟู นอกจากนี้ Red Bean เต็มไปด้วยโปรตีน ใยอาหาร และสารอาหารที่สำคัญอื่นๆ ที่ช่วยส่งเสริมสุขภาพของร่างกาย", "การผสมผสานรสชาติของ Matcha และ Red Bean ไม่เพียงแต่ช่วยสร้างรสชาติที่เข้มข้นและหวานหอม แต่ยังเสริมสร้างสารอาหารที่สำคัญให้กับร่างกายด้วยกัน คู่นี้เป็นที่นิยมในอาหารหลายชนิด เช่น ไอศกรีม คาปูชิโน ขนมปัง และเค้กเป็นต้น", "การรับประทาน Matcha และ Red Bean ไม่เพียงแต่เสริมสร้างรสชาติที่อร่อยและประโยชน์สุขภาพ แต่ยังเสริมสร้างประสบการณ์ทางอาหารที่น่าจดจำ คู่นี้ไม่เพียงแต่ถูกใจในวงการอาหารญี่ปุ่นและเอเชีย แต่ยังได้รับความนิยมอย่างกว้างขวางในวงการอาหารทั่วโลก", "การรับประทาน Matcha และ Red Bean ไม่ใช่เพียงแค่การทำให้คุณอร่อย แต่ยังเป็นการดูแลสุขภาพของคุณด้วยความสนุกสนานและคุณค่าทางอาหารที่มีคุณค่าสูง"],
        image: matchaImage,
    },
    {
        id: "04",
        title: "โปรตีนเชคมอคค่าเพิ่มพลังงาน",
        subTitle: "กำลังมองหาแรงกระตุ้นเล็กๆเพื่อผ่านพ้นวันของคุณอยู่ใช่ไหม?",
        detail: "การรักษาสุขภาพและความแข็งแรงของร่างกายต้องการการบำรุงร่างกายด้วยโปรตีนและสารอาหารที่สมบูรณ์ โปรตีนเชค มอคค่า (Protein Shake Mocha) เป็นทางเลือกที่เป็นที่นิยมในวงการออกกำลังกายและการดูแลสุขภาพ เนื่องจากมีประโยชน์ทั้งในเรื่องของโปรตีนสูง และความอร่อยของรสชาติ มาเราสำรวจถึงความสำคัญและประโยชน์ของโปรตีนเชค มอคค่า ในการเพิ่มพลังงานและสร้างร่างกายที่แข็งแรงได้ดังนี้:",
        contentTitle: ["โปรตีนเชค มอคค่า: การบำรุงร่างกายด้วยโปรตีนที่สมบูรณ์และรสชาติที่อร่อย", "การเพิ่มพลังงาน", "การสร้างก้าวกระโดดสู่สุขภาพที่ดี", "สรุป"],
        content: ["โปรตีนเชค มอคค่า เป็นเครื่องดื่มที่ผสมโปรตีน คาร์โบไฮเดรต และไขมันที่มีประโยชน์ มาในรสชาติของกาแฟมอคค่า ซึ่งทำให้มีความนิยมในผู้ที่กำลังมองหาเครื่องดื่มที่สามารถให้พลังงานและโปรตีนที่จำเป็นในการฟื้นฟูกล้ามเนื้อหลังจากการออกกำลังกายหรือกิจกรรมทางกายสุขภาพอื่นๆ", "โปรตีนเชค มอคค่า เป็นทางเลือกที่ดีในการเพิ่มพลังงานให้กับร่างกาย โดยเฉพาะในช่วงเช้าหรือช่วงก่อนการออกกำลังกาย เนื่องจากมีความสามารถในการให้พลังงานและความกระปรี้กระเปร่า ทำให้ร่างกายพร้อมที่จะเริ่มต้นกิจกรรมของวันได้อย่างกระชับและสดชื่น", "การบริโภคโปรตีนเชค มอคค่า เป็นส่วนสำคัญในการสร้างก้าวกระโดดสู่สุขภาพที่ดี เนื่องจากโปรตีนเป็นส่วนสำคัญในการฟื้นฟูกล้ามเนื้อ สร้างเซลล์ใหม่ และปรับปรุงระบบภูมิคุ้มกัน ทำให้ร่างกายมีความแข็งแรงและมีสมรรถภาพที่ดีในการต่อสู้กับโรคต่างๆ", "โปรตีนเชค มอคค่า เป็นเครื่องดื่มที่มีคุณค่าทางอาหารสูงและรสชาติที่อร่อย ทำให้เป็นทางเลือกที่ดีในการเพิ่มพลังงาน สร้างกล้ามเนื้อ และสร้างสุขภาพที่ดีสำหรับผู้ที่ต้องการร่างกายที่แข็งแรงและสมบูรณ์แบบ ดังนั้น หากคุณกำลังมองหาเครื่องดื่มที่ช่วยให้คุณมีพลังงานและสุขภาพที่ดี โปรตีนเชค มอคค่า อาจเป็นตัวเลือกที่คุณควรคำนึงถึง"],
        image: proteinShakeImage,
    },
];

export default HealthBlog;